# Proyecto Final: Análisis de Datos usando Spark

<p style="text-align:center">
    <a href="https://skills.network" target="_blank">
    <img src="https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/assets/logos/SN_web_lightmode.png" width="200" alt="Skills Network Logo">
    </a>
</p>

## Introducción
En el proyecto final, realizarás las tareas mencionadas por tu cuenta. Las tareas a realizar son similares a las que hiciste en el laboratorio de práctica; sin embargo, no se te proporcionarán instrucciones paso a paso.

Este proyecto se centra en dominar Spark SQL, un componente poderoso de Apache Spark que te permite trabajar con datos estructurados utilizando consultas similares a SQL. Crearás un DataFrame a partir de un archivo CSV, definirás un esquema para los datos y aprovecharás Spark SQL para realizar transformaciones y acciones sobre los datos.

## Escenario
Se te ha encargado por el departamento de recursos humanos de una empresa crear un pipeline de datos que pueda recibir datos de empleados en formato CSV. Tus responsabilidades incluyen analizar los datos, aplicar las transformaciones necesarias y facilitar la extracción de información valiosa de los datos procesados.

Dado tu papel como ingeniero de datos, se te ha solicitado aprovechar los componentes de Apache Spark para llevar a cabo las tareas.

## Visión General del Proyecto
Crea un DataFrame cargando datos desde un archivo CSV y aplica transformaciones y acciones utilizando Spark SQL. Esto debe lograrse realizando las siguientes tareas:

- Tarea 1: Generar DataFrame a partir de datos CSV.
- Tarea 2: Definir un esquema para los datos.
- Tarea 3: Mostrar el esquema del DataFrame.
- Tarea 4: Crear una vista temporal.
- Tarea 5: Ejecutar una consulta SQL.
- Tarea 6: Calcular el Salario Promedio por Departamento.
- Tarea 7: Filtrar y Mostrar Empleados del Departamento de TI.
- Tarea 8: Agregar un Bonificación del 10% a los Salarios.
- Tarea 9: Encontrar el Salario Máximo por Edad.
- Tarea 10: Auto-Unirse a los Datos de Empleados.
- Tarea 11: Calcular la Edad Promedio de los Empleados.
- Tarea 12: Calcular el Salario Total por Departamento.
- Tarea 13: Ordenar Datos por Edad y Salario.
- Tarea 14: Contar Empleados en Cada Departamento.
- Tarea 15: Filtrar Empleados con la letra o en el Nombre.

Se te proporcionará un entorno de Jupyter notebook para completar este proyecto. Asegúrate de seguir las instrucciones proporcionadas y utilizar las bibliotecas de Python y Spark (PySpark) en tu entorno de laboratorio. Las tareas en este proyecto te permitirán trabajar eficazmente con DataFrames, definir esquemas, usar Spark SQL para consultas y realizar transformaciones y acciones en los datos. Al finalizar, tendrás un sólido entendimiento de Spark SQL y su aplicación en escenarios del mundo real.

# Final Project: Data Analysis using Spark

This final project is similar to the Practice Project you did. In this project, you will not be provided with hints or solutions. You will create a DataFrame by loading data from a CSV file and apply transformations and actions using Spark SQL. This needs to be achieved by performing the following tasks:

- Task 1: Generate DataFrame from CSV data.
- Task 2: Define a schema for the data.
- Task 3: Display schema of DataFrame.
- Task 4: Create a temporary view.
- Task 5: Execute an SQL query.
- Task 6: Calculate Average Salary by Department.
- Task 7: Filter and Display IT Department Employees.
- Task 8: Add 10% Bonus to Salaries.
- Task 9: Find Maximum Salary by Age.
- Task 10: Self-Join on Employee Data.
- Task 11: Calculate Average Employee Age.
- Task 12: Calculate Total Salary by Department.
- Task 13: Sort Data by Age and Salary.
- Task 14: Count Employees in Each Department.
- Task 15: Filter Employees with the letter o in the Name.

### Prerequisites 

1. For this lab assignment, you will be using Python and Spark (PySpark). Therefore, it's essential to make sure that the following libraries are installed in your lab environment or within Skills Network (SN) Labs

In [ ]:
# Installing required packages  

#!pip install pyspark  findspark wget

Requirement already satisfied: pyspark in /home/dg_su/spark-env/lib/python3.10/site-packages (3.3.3)
Requirement already satisfied: findspark in /home/dg_su/spark-env/lib/python3.10/site-packages (2.0.1)
Requirement already satisfied: wget in /home/dg_su/spark-env/lib/python3.10/site-packages (3.2)
Requirement already satisfied: py4j==0.10.9.5 in /home/dg_su/spark-env/lib/python3.10/site-packages (from pyspark) (0.10.9.5)

[notice] A new release of pip is available: 23.0.1 -> 25.3
[notice] To update, run: pip install --upgrade pip

In [2]:
import findspark

findspark.init()

In [3]:
# PySpark is the Spark API for Python. In this lab, we use PySpark to initialize the SparkContext.   

from pyspark import SparkContext, SparkConf
from pyspark.sql import SparkSession

In [4]:
# Creating a SparkContext object  
sc = SparkContext.getOrCreate()

# Creating a SparkSession  

spark = SparkSession \
    .builder \
    .appName("Python Spark DataFrames basic example") \
    .config("spark.some.config.option", "some-value") \
    .getOrCreate()

your 131072x1 screen size is bogus. expect trouble

25/12/03 10:40:32 WARN Utils: Your hostname, DiegoSrz resolves to a loopback address: 127.0.1.1; using 10.255.255.254 instead (on interface lo)
25/12/03 10:40:32 WARN Utils: Set SPARK_LOCAL_IP if you need to bind to another address

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

25/12/03 10:40:33 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

2. Download the CSV data.

In [5]:
# Download the CSV data first into a local `employees.csv` file
import wget
wget.download("https://cf-courses-data.s3.us.cloud-object-storage.appdomain.cloud/IBM-BD0225EN-SkillsNetwork/data/employees.csv")

'employees.csv'

### Tasks

#### Task 1: Generate a Spark DataFrame from the CSV data

Read data from the provided CSV file, `employees.csv` and import it into a Spark DataFrame variable named `employees_df`.

In [31]:
# Read data from the "emp" CSV file and import it into a DataFrame variable named "employees_df"  

employees_df = spark.read.csv("employees.csv", header=True, inferSchema=True)
employees_df.show()

+------+---------+------+---+----------+
|Emp_No| Emp_Name|Salary|Age|Department|
+------+---------+------+---+----------+
|   198|   Donald|  2600| 29|        IT|
|   199|  Douglas|  2600| 34|     Sales|
|   200| Jennifer|  4400| 36| Marketing|
|   201|  Michael| 13000| 32|        IT|
|   202|      Pat|  6000| 39|        HR|
|   203|    Susan|  6500| 36| Marketing|
|   204|  Hermann| 10000| 29|   Finance|
|   205|  Shelley| 12008| 33|   Finance|
|   206|  William|  8300| 37|        IT|
|   100|   Steven| 24000| 39|        IT|
|   101|    Neena| 17000| 27|     Sales|
|   102|      Lex| 17000| 37| Marketing|
|   103|Alexander|  9000| 39| Marketing|
|   104|    Bruce|  6000| 38|        IT|
|   105|    David|  4800| 39|        IT|
|   106|    Valli|  4800| 38|     Sales|
|   107|    Diana|  4200| 35|     Sales|
|   108|    Nancy| 12008| 28|     Sales|
|   109|   Daniel|  9000| 35|        HR|
|   110|     John|  8200| 31| Marketing|
+------+---------+------+---+----------+
only showing top 20 rows

#### Task 2: Define a schema for the data

Construct a schema for the input data and then utilize the defined schema to read the CSV file to create a DataFrame named `employees_df`.

In [32]:
# Define a Schema for the input data and read the file using the user-defined Schema
from pyspark.sql.types import StructType, IntegerType, FloatType, StringType, StructField

schema = StructType(
    [
        StructField("Emp_No", IntegerType(),False),
        StructField("Emp_Name", StringType(),False),
        StructField("Salary",IntegerType(),False),
        StructField("Age",IntegerType(),False),
        StructField("Department",StringType(),False)
    ]
)

employees_df = (
    spark.read.format("csv").schema(schema).option("header", "true").load("employees.csv")
)

employees_df.show()

+------+---------+------+---+----------+
|Emp_No| Emp_Name|Salary|Age|Department|
+------+---------+------+---+----------+
|   198|   Donald|  2600| 29|        IT|
|   199|  Douglas|  2600| 34|     Sales|
|   200| Jennifer|  4400| 36| Marketing|
|   201|  Michael| 13000| 32|        IT|
|   202|      Pat|  6000| 39|        HR|
|   203|    Susan|  6500| 36| Marketing|
|   204|  Hermann| 10000| 29|   Finance|
|   205|  Shelley| 12008| 33|   Finance|
|   206|  William|  8300| 37|        IT|
|   100|   Steven| 24000| 39|        IT|
|   101|    Neena| 17000| 27|     Sales|
|   102|      Lex| 17000| 37| Marketing|
|   103|Alexander|  9000| 39| Marketing|
|   104|    Bruce|  6000| 38|        IT|
|   105|    David|  4800| 39|        IT|
|   106|    Valli|  4800| 38|     Sales|
|   107|    Diana|  4200| 35|     Sales|
|   108|    Nancy| 12008| 28|     Sales|
|   109|   Daniel|  9000| 35|        HR|
|   110|     John|  8200| 31| Marketing|
+------+---------+------+---+----------+
only showing top 20 rows

#### Task 3: Display schema of DataFrame

Display the schema of the `employees_df` DataFrame, showing all columns and their respective data types.

In [33]:
# Display all columns of the DataFrame, along with their respective data types
employees_df.printSchema()

root
 |-- Emp_No: integer (nullable = true)
 |-- Emp_Name: string (nullable = true)
 |-- Salary: integer (nullable = true)
 |-- Age: integer (nullable = true)
 |-- Department: string (nullable = true)

#### Task 4: Create a temporary view

Create a temporary view named `employees` for the `employees_df` DataFrame, enabling Spark SQL queries on the data.

In [34]:
# Create a temporary view named "employees" for the DataFrame
#employees_df.createTempView("employees")
spark.sql("SELECT * FROM employees").show()

+------+---------+------+---+----------+
|Emp_No| Emp_Name|Salary|Age|Department|
+------+---------+------+---+----------+
|   198|   Donald|  2600| 29|        IT|
|   199|  Douglas|  2600| 34|     Sales|
|   200| Jennifer|  4400| 36| Marketing|
|   201|  Michael| 13000| 32|        IT|
|   202|      Pat|  6000| 39|        HR|
|   203|    Susan|  6500| 36| Marketing|
|   204|  Hermann| 10000| 29|   Finance|
|   205|  Shelley| 12008| 33|   Finance|
|   206|  William|  8300| 37|        IT|
|   100|   Steven| 24000| 39|        IT|
|   101|    Neena| 17000| 27|     Sales|
|   102|      Lex| 17000| 37| Marketing|
|   103|Alexander|  9000| 39| Marketing|
|   104|    Bruce|  6000| 38|        IT|
|   105|    David|  4800| 39|        IT|
|   106|    Valli|  4800| 38|     Sales|
|   107|    Diana|  4200| 35|     Sales|
|   108|    Nancy| 12008| 28|     Sales|
|   109|   Daniel|  9000| 35|        HR|
|   110|     John|  8200| 31| Marketing|
+------+---------+------+---+----------+
only showing top 20 rows

#### Task 5: Execute an SQL query

Compose and execute an SQL query to fetch the records from the `employees` view where the age of employees exceeds 30. Then, display the result of the SQL query, showcasing the filtered records.

In [35]:
# SQL query to fetch solely the records from the View where the age exceeds 30
spark.sql("SELECT * FROM employees WHERE Age > 30").show()

+------+-----------+------+---+----------+
|Emp_No|   Emp_Name|Salary|Age|Department|
+------+-----------+------+---+----------+
|   199|    Douglas|  2600| 34|     Sales|
|   200|   Jennifer|  4400| 36| Marketing|
|   201|    Michael| 13000| 32|        IT|
|   202|        Pat|  6000| 39|        HR|
|   203|      Susan|  6500| 36| Marketing|
|   205|    Shelley| 12008| 33|   Finance|
|   206|    William|  8300| 37|        IT|
|   100|     Steven| 24000| 39|        IT|
|   102|        Lex| 17000| 37| Marketing|
|   103|  Alexander|  9000| 39| Marketing|
|   104|      Bruce|  6000| 38|        IT|
|   105|      David|  4800| 39|        IT|
|   106|      Valli|  4800| 38|     Sales|
|   107|      Diana|  4200| 35|     Sales|
|   109|     Daniel|  9000| 35|        HR|
|   110|       John|  8200| 31| Marketing|
|   111|     Ismael|  7700| 32|        IT|
|   112|Jose Manuel|  7800| 34|        HR|
|   113|       Luis|  6900| 34|     Sales|
|   116|     Shelli|  2900| 37|   Finance|
+------+-----------+------+---+----------+
only showing top 20 rows

#### Task 6: Calculate Average Salary by Department

Compose an SQL query to retrieve the average salary of employees grouped by department. Display the result.

In [36]:
# SQL query to calculate the average salary of employees grouped by department
spark.sql("SELECT Department, ROUND(AVG(Salary),2) FROM employees GROUP BY department").show()

+----------+---------------------+
|Department|round(avg(Salary), 2)|
+----------+---------------------+
|     Sales|              5492.92|
|        HR|               5837.5|
|   Finance|               5730.8|
| Marketing|              6633.33|
|        IT|               7400.0|
+----------+---------------------+

#### Task 7: Filter and Display IT Department Employees

Apply a filter on the `employees_df` DataFrame to select records where the department is `'IT'`. Display the filtered DataFrame.

In [37]:
# Apply a filter to select records where the department is 'IT'
spark.sql("SELECT * FROM employees WHERE department = 'IT'").show()

+------+--------+------+---+----------+
|Emp_No|Emp_Name|Salary|Age|Department|
+------+--------+------+---+----------+
|   198|  Donald|  2600| 29|        IT|
|   201| Michael| 13000| 32|        IT|
|   206| William|  8300| 37|        IT|
|   100|  Steven| 24000| 39|        IT|
|   104|   Bruce|  6000| 38|        IT|
|   105|   David|  4800| 39|        IT|
|   111|  Ismael|  7700| 32|        IT|
|   129|   Laura|  3300| 38|        IT|
|   132|      TJ|  2100| 34|        IT|
|   136|   Hazel|  2200| 29|        IT|
+------+--------+------+---+----------+

#### Task 8: Add 10% Bonus to Salaries

Perform a transformation to add a new column named "SalaryAfterBonus" to the DataFrame. Calculate the new salary by adding a 10% bonus to each employee's salary.

In [38]:
from pyspark.sql.functions import col

# Add a new column "SalaryAfterBonus" with 10% bonus added to the original salary

employees_df= employees_df.withColumn("SalaryAfterBonus",employees_df["Salary"]*1.10)
employees_df.show()

+------+---------+------+---+----------+------------------+
|Emp_No| Emp_Name|Salary|Age|Department|  SalaryAfterBonus|
+------+---------+------+---+----------+------------------+
|   198|   Donald|  2600| 29|        IT|2860.0000000000005|
|   199|  Douglas|  2600| 34|     Sales|2860.0000000000005|
|   200| Jennifer|  4400| 36| Marketing|            4840.0|
|   201|  Michael| 13000| 32|        IT|14300.000000000002|
|   202|      Pat|  6000| 39|        HR| 6600.000000000001|
|   203|    Susan|  6500| 36| Marketing| 7150.000000000001|
|   204|  Hermann| 10000| 29|   Finance|           11000.0|
|   205|  Shelley| 12008| 33|   Finance|13208.800000000001|
|   206|  William|  8300| 37|        IT|            9130.0|
|   100|   Steven| 24000| 39|        IT|26400.000000000004|
|   101|    Neena| 17000| 27|     Sales|           18700.0|
|   102|      Lex| 17000| 37| Marketing|           18700.0|
|   103|Alexander|  9000| 39| Marketing|            9900.0|
|   104|    Bruce|  6000| 38|        IT| 6600.000000000001|
|   105|    David|  4800| 39|        IT|            5280.0|
|   106|    Valli|  4800| 38|     Sales|            5280.0|
|   107|    Diana|  4200| 35|     Sales|            4620.0|
|   108|    Nancy| 12008| 28|     Sales|13208.800000000001|
|   109|   Daniel|  9000| 35|        HR|            9900.0|
|   110|     John|  8200| 31| Marketing|            9020.0|
+------+---------+------+---+----------+------------------+
only showing top 20 rows

#### Task 9: Find Maximum Salary by Age

Group the data by age and calculate the maximum salary for each age group. Display the result.

In [43]:
from pyspark.sql.functions import max

# Group data by age and calculate the maximum salary for each age group
spark.sql("SELECT Age, MAX(Salary) AS MaximumSalary FROM employees GROUP BY Age ORDER BY 2 DESC").show()

+---+-------------+
|Age|MaximumSalary|
+---+-------------+
| 39|        24000|
| 27|        17000|
| 37|        17000|
| 32|        13000|
| 28|        12008|
| 33|        12008|
| 29|        10000|
| 35|         9000|
| 31|         8200|
| 30|         8000|
| 36|         7900|
| 34|         7800|
| 38|         6000|
| 26|         3600|
+---+-------------+

#### Task 10: Self-Join on Employee Data

Join the "employees_df" DataFrame with itself based on the "Emp_No" column. Display the result.

In [46]:
# Join the DataFrame with itself based on the "Emp_No" column
spark.sql("SELECT * FROM employees e INNER JOIN employees p ON e.Emp_No = p.Emp_NO").show()

+------+---------+------+---+----------+------+---------+------+---+----------+
|Emp_No| Emp_Name|Salary|Age|Department|Emp_No| Emp_Name|Salary|Age|Department|
+------+---------+------+---+----------+------+---------+------+---+----------+
|   198|   Donald|  2600| 29|        IT|   198|   Donald|  2600| 29|        IT|
|   199|  Douglas|  2600| 34|     Sales|   199|  Douglas|  2600| 34|     Sales|
|   200| Jennifer|  4400| 36| Marketing|   200| Jennifer|  4400| 36| Marketing|
|   201|  Michael| 13000| 32|        IT|   201|  Michael| 13000| 32|        IT|
|   202|      Pat|  6000| 39|        HR|   202|      Pat|  6000| 39|        HR|
|   203|    Susan|  6500| 36| Marketing|   203|    Susan|  6500| 36| Marketing|
|   204|  Hermann| 10000| 29|   Finance|   204|  Hermann| 10000| 29|   Finance|
|   205|  Shelley| 12008| 33|   Finance|   205|  Shelley| 12008| 33|   Finance|
|   206|  William|  8300| 37|        IT|   206|  William|  8300| 37|        IT|
|   100|   Steven| 24000| 39|        IT|   100|   Steven| 24000| 39|        IT|
|   101|    Neena| 17000| 27|     Sales|   101|    Neena| 17000| 27|     Sales|
|   102|      Lex| 17000| 37| Marketing|   102|      Lex| 17000| 37| Marketing|
|   103|Alexander|  9000| 39| Marketing|   103|Alexander|  9000| 39| Marketing|
|   104|    Bruce|  6000| 38|        IT|   104|    Bruce|  6000| 38|        IT|
|   105|    David|  4800| 39|        IT|   105|    David|  4800| 39|        IT|
|   106|    Valli|  4800| 38|     Sales|   106|    Valli|  4800| 38|     Sales|
|   107|    Diana|  4200| 35|     Sales|   107|    Diana|  4200| 35|     Sales|
|   108|    Nancy| 12008| 28|     Sales|   108|    Nancy| 12008| 28|     Sales|
|   109|   Daniel|  9000| 35|        HR|   109|   Daniel|  9000| 35|        HR|
|   110|     John|  8200| 31| Marketing|   110|     John|  8200| 31| Marketing|
+------+---------+------+---+----------+------+---------+------+---+----------+
only showing top 20 rows

#### Task 11: Calculate Average Employee Age

Calculate the average age of employees using the built-in aggregation function. Display the result.

In [47]:
# Calculate the average age of employees
from pyspark.sql.functions import avg 

employees_df.select(avg("age")).show()

+--------+
|avg(age)|
+--------+
|   33.56|
+--------+

In [48]:
spark.sql("SELECT AVG(Age) FROM employees").show()

+--------+
|avg(Age)|
+--------+
|   33.56|
+--------+

In [49]:
employees_df.agg(avg("Age")).show()

+--------+
|avg(Age)|
+--------+
|   33.56|
+--------+

#### Task 12: Calculate Total Salary by Department

Calculate the total salary for each department using the built-in aggregation function. Display the result.

In [54]:
# Calculate the total salary for each department. Hint - User GroupBy and Aggregate functions
from pyspark.sql.functions import sum 

employees_df.groupby("Department").agg(sum("Salary").alias("TotalSalary")).show()

+----------+-----------+
|Department|TotalSalary|
+----------+-----------+
|     Sales|      71408|
|        HR|      46700|
|   Finance|      57308|
| Marketing|      59700|
|        IT|      74000|
+----------+-----------+

#### Task 13: Sort Data by Age and Salary

Apply a transformation to sort the DataFrame by age in ascending order and then by salary in descending order. Display the sorted DataFrame.

In [55]:
# Sort the DataFrame by age in ascending order and then by salary in descending order

spark.sql("SELECT * FROM employees ORDER BY Age ASC, Salary DESC").show()

+------+---------+------+---+----------+
|Emp_No| Emp_Name|Salary|Age|Department|
+------+---------+------+---+----------+
|   137|   Renske|  3600| 26| Marketing|
|   101|    Neena| 17000| 27|     Sales|
|   114|      Den| 11000| 27|   Finance|
|   108|    Nancy| 12008| 28|     Sales|
|   130|    Mozhe|  2800| 28| Marketing|
|   126|    Irene|  2700| 28|        HR|
|   204|  Hermann| 10000| 29|   Finance|
|   115|Alexander|  3100| 29|   Finance|
|   134|  Michael|  2900| 29|     Sales|
|   198|   Donald|  2600| 29|        IT|
|   140|   Joshua|  2500| 29|   Finance|
|   136|    Hazel|  2200| 29|        IT|
|   120|  Matthew|  8000| 30|        HR|
|   110|     John|  8200| 31| Marketing|
|   127|    James|  2400| 31|        HR|
|   201|  Michael| 13000| 32|        IT|
|   111|   Ismael|  7700| 32|        IT|
|   119|    Karen|  2500| 32|   Finance|
|   205|  Shelley| 12008| 33|   Finance|
|   124|    Kevin|  5800| 33| Marketing|
+------+---------+------+---+----------+
only showing top 20 rows

In [56]:
from pyspark.sql.functions import col

employees_df.orderBy(col("Age").asc(), col("Salary").desc()).show()

+------+---------+------+---+----------+------------------+
|Emp_No| Emp_Name|Salary|Age|Department|  SalaryAfterBonus|
+------+---------+------+---+----------+------------------+
|   137|   Renske|  3600| 26| Marketing|3960.0000000000005|
|   101|    Neena| 17000| 27|     Sales|           18700.0|
|   114|      Den| 11000| 27|   Finance|12100.000000000002|
|   108|    Nancy| 12008| 28|     Sales|13208.800000000001|
|   130|    Mozhe|  2800| 28| Marketing|3080.0000000000005|
|   126|    Irene|  2700| 28|        HR|2970.0000000000005|
|   204|  Hermann| 10000| 29|   Finance|           11000.0|
|   115|Alexander|  3100| 29|   Finance|3410.0000000000005|
|   134|  Michael|  2900| 29|     Sales|3190.0000000000005|
|   198|   Donald|  2600| 29|        IT|2860.0000000000005|
|   140|   Joshua|  2500| 29|   Finance|            2750.0|
|   136|    Hazel|  2200| 29|        IT|            2420.0|
|   120|  Matthew|  8000| 30|        HR|            8800.0|
|   110|     John|  8200| 31| Marketing|            9020.0|
|   127|    James|  2400| 31|        HR|            2640.0|
|   201|  Michael| 13000| 32|        IT|14300.000000000002|
|   111|   Ismael|  7700| 32|        IT|            8470.0|
|   119|    Karen|  2500| 32|   Finance|            2750.0|
|   205|  Shelley| 12008| 33|   Finance|13208.800000000001|
|   124|    Kevin|  5800| 33| Marketing| 6380.000000000001|
+------+---------+------+---+----------+------------------+
only showing top 20 rows

In [57]:
employees_df.sort(col("Age").asc(), col("Salary").desc()).show()

+------+---------+------+---+----------+------------------+
|Emp_No| Emp_Name|Salary|Age|Department|  SalaryAfterBonus|
+------+---------+------+---+----------+------------------+
|   137|   Renske|  3600| 26| Marketing|3960.0000000000005|
|   101|    Neena| 17000| 27|     Sales|           18700.0|
|   114|      Den| 11000| 27|   Finance|12100.000000000002|
|   108|    Nancy| 12008| 28|     Sales|13208.800000000001|
|   130|    Mozhe|  2800| 28| Marketing|3080.0000000000005|
|   126|    Irene|  2700| 28|        HR|2970.0000000000005|
|   204|  Hermann| 10000| 29|   Finance|           11000.0|
|   115|Alexander|  3100| 29|   Finance|3410.0000000000005|
|   134|  Michael|  2900| 29|     Sales|3190.0000000000005|
|   198|   Donald|  2600| 29|        IT|2860.0000000000005|
|   140|   Joshua|  2500| 29|   Finance|            2750.0|
|   136|    Hazel|  2200| 29|        IT|            2420.0|
|   120|  Matthew|  8000| 30|        HR|            8800.0|
|   110|     John|  8200| 31| Marketing|            9020.0|
|   127|    James|  2400| 31|        HR|            2640.0|
|   201|  Michael| 13000| 32|        IT|14300.000000000002|
|   111|   Ismael|  7700| 32|        IT|            8470.0|
|   119|    Karen|  2500| 32|   Finance|            2750.0|
|   205|  Shelley| 12008| 33|   Finance|13208.800000000001|
|   124|    Kevin|  5800| 33| Marketing| 6380.000000000001|
+------+---------+------+---+----------+------------------+
only showing top 20 rows

In [61]:
employees_df.orderBy(employees_df["Age"].asc(), employees_df["Salary"].desc()).show()

+------+---------+------+---+----------+------------------+
|Emp_No| Emp_Name|Salary|Age|Department|  SalaryAfterBonus|
+------+---------+------+---+----------+------------------+
|   137|   Renske|  3600| 26| Marketing|3960.0000000000005|
|   101|    Neena| 17000| 27|     Sales|           18700.0|
|   114|      Den| 11000| 27|   Finance|12100.000000000002|
|   108|    Nancy| 12008| 28|     Sales|13208.800000000001|
|   130|    Mozhe|  2800| 28| Marketing|3080.0000000000005|
|   126|    Irene|  2700| 28|        HR|2970.0000000000005|
|   204|  Hermann| 10000| 29|   Finance|           11000.0|
|   115|Alexander|  3100| 29|   Finance|3410.0000000000005|
|   134|  Michael|  2900| 29|     Sales|3190.0000000000005|
|   198|   Donald|  2600| 29|        IT|2860.0000000000005|
|   140|   Joshua|  2500| 29|   Finance|            2750.0|
|   136|    Hazel|  2200| 29|        IT|            2420.0|
|   120|  Matthew|  8000| 30|        HR|            8800.0|
|   110|     John|  8200| 31| Marketing|            9020.0|
|   127|    James|  2400| 31|        HR|            2640.0|
|   201|  Michael| 13000| 32|        IT|14300.000000000002|
|   111|   Ismael|  7700| 32|        IT|            8470.0|
|   119|    Karen|  2500| 32|   Finance|            2750.0|
|   205|  Shelley| 12008| 33|   Finance|13208.800000000001|
|   124|    Kevin|  5800| 33| Marketing| 6380.000000000001|
+------+---------+------+---+----------+------------------+
only showing top 20 rows

#### Task 14: Count Employees in Each Department

Calculate the number of employees in each department. Display the result.

In [64]:
from pyspark.sql.functions import count

# Calculate the number of employees in each department
employees_df.groupBy("Department").agg(count("Emp_no")).show()

+----------+-------------+
|Department|count(Emp_no)|
+----------+-------------+
|     Sales|           13|
|        HR|            8|
|   Finance|           10|
| Marketing|            9|
|        IT|           10|
+----------+-------------+

In [66]:
spark.sql("SELECT Department, COUNT(Emp_no) FROM employees GROUP BY Department").show()

+----------+-------------+
|Department|count(Emp_no)|
+----------+-------------+
|     Sales|           13|
|        HR|            8|
|   Finance|           10|
| Marketing|            9|
|        IT|           10|
+----------+-------------+

#### Task 15: Filter Employees with the letter o in the Name

Apply a filter to select records where the employee's name contains the letter `'o'`. Display the filtered DataFrame.

In [68]:
# Apply a filter to select records where the employee's name contains the letter 'o'

spark.sql("SELECT * FROM employees WHERE Emp_Name LIKE '%o%'").show()

+------+-----------+------+---+----------+
|Emp_No|   Emp_Name|Salary|Age|Department|
+------+-----------+------+---+----------+
|   198|     Donald|  2600| 29|        IT|
|   199|    Douglas|  2600| 34|     Sales|
|   110|       John|  8200| 31| Marketing|
|   112|Jose Manuel|  7800| 34|        HR|
|   130|      Mozhe|  2800| 28| Marketing|
|   133|      Jason|  3300| 38|     Sales|
|   139|       John|  2700| 36|     Sales|
|   140|     Joshua|  2500| 29|   Finance|
+------+-----------+------+---+----------+

In [70]:
employees_df.filter(col("Emp_Name").contains("o")).show()

+------+-----------+------+---+----------+------------------+
|Emp_No|   Emp_Name|Salary|Age|Department|  SalaryAfterBonus|
+------+-----------+------+---+----------+------------------+
|   198|     Donald|  2600| 29|        IT|2860.0000000000005|
|   199|    Douglas|  2600| 34|     Sales|2860.0000000000005|
|   110|       John|  8200| 31| Marketing|            9020.0|
|   112|Jose Manuel|  7800| 34|        HR|            8580.0|
|   130|      Mozhe|  2800| 28| Marketing|3080.0000000000005|
|   133|      Jason|  3300| 38|     Sales|3630.0000000000005|
|   139|       John|  2700| 36|     Sales|2970.0000000000005|
|   140|     Joshua|  2500| 29|   Finance|            2750.0|
+------+-----------+------+---+----------+------------------+

In [71]:
employees_df.filter(col("Emp_Name").like("%o%")).show()

+------+-----------+------+---+----------+------------------+
|Emp_No|   Emp_Name|Salary|Age|Department|  SalaryAfterBonus|
+------+-----------+------+---+----------+------------------+
|   198|     Donald|  2600| 29|        IT|2860.0000000000005|
|   199|    Douglas|  2600| 34|     Sales|2860.0000000000005|
|   110|       John|  8200| 31| Marketing|            9020.0|
|   112|Jose Manuel|  7800| 34|        HR|            8580.0|
|   130|      Mozhe|  2800| 28| Marketing|3080.0000000000005|
|   133|      Jason|  3300| 38|     Sales|3630.0000000000005|
|   139|       John|  2700| 36|     Sales|2970.0000000000005|
|   140|     Joshua|  2500| 29|   Finance|            2750.0|
+------+-----------+------+---+----------+------------------+

# Congratulations! You have completed the project.

Now you know how to create a DataFrame from a CSV data file and perform a variety of DataFrame transformations and actions using Spark SQL.

## Authors

Raghul Ramesh

Lavanya T S

<!--## Change Log -->

<!--|Date (YYYY-MM-DD)|Version|Changed By|Change Description|
|-|-|-|-|
|2023-09-01|0.1|Lavanya T S|Initial version|
|2023-09-11|0.2|Pornima More|QA pass with edits|-->

<h3 align="center"> &#169; IBM Corporation. All rights reserved. <h3/>